In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('stock_exchange_data/indexData.csv')

In [3]:
df.head()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
0,NYA,1965-12-31,528.690002,528.690002,528.690002,528.690002,528.690002,0.0
1,NYA,1966-01-03,527.210022,527.210022,527.210022,527.210022,527.210022,0.0
2,NYA,1966-01-04,527.840027,527.840027,527.840027,527.840027,527.840027,0.0
3,NYA,1966-01-05,531.119995,531.119995,531.119995,531.119995,531.119995,0.0
4,NYA,1966-01-06,532.070007,532.070007,532.070007,532.070007,532.070007,0.0

In [4]:
df.tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

In [ ]:
df.index # return the actualy index range

RangeIndex(start=0, stop=112457, step=1)

In [ ]:
df.Index # return the index series

0          NYA
1          NYA
2          NYA
3          NYA
4          NYA
          ...
112452    N100
112453    N100
112454    N100
112455    N100
112456    N100
Name: Index, Length: 112457, dtype: object

In [8]:
df['Index']

0          NYA
1          NYA
2          NYA
3          NYA
4          NYA
          ...
112452    N100
112453    N100
112454    N100
112455    N100
112456    N100
Name: Index, Length: 112457, dtype: object

In [9]:
df['Index'][0]

'NYA'

## iloc

- Index-based Selection

    Both loc and iloc are row-first, column-second. This is the opposite of what we do in native Python, which is column-first, row-second.

    This means that it's marginally easier to retrieve rows, and marginally harder to get retrieve columns.

In [10]:
df.iloc[0] # retrieve the row at index 0

Index               NYA
Date         1965-12-31
Open         528.690002
High         528.690002
Low          528.690002
Close        528.690002
Adj Close    528.690002
Volume              0.0
Name: 0, dtype: object

In [11]:
df.iloc[:, 1] # retrieve all rows (all indexes), at column 1

0         1965-12-31
1         1966-01-03
2         1966-01-04
3         1966-01-05
4         1966-01-06
             ...
112452    2021-05-27
112453    2021-05-28
112454    2021-05-31
112455    2021-06-01
112456    2021-06-02
Name: Date, Length: 112457, dtype: object

In [12]:
df.iloc[:3, 1] # retrieve first 3 rows, at column 1

0    1965-12-31
1    1966-01-03
2    1966-01-04
Name: Date, dtype: object

In [13]:
df.iloc[[1, 2, 3, 4], 1] # retrieve all rows in the index list, at column 1

1    1966-01-03
2    1966-01-04
3    1966-01-05
4    1966-01-06
Name: Date, dtype: object

In [14]:
df.tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

In [15]:
df.iloc[-5:] # retrieve last 5 indexes, equivalent to tail()

,Index,Date,Open,High,Low,Close,Adj Close,Volume
112452,N100,2021-05-27,1241.119995,1251.910034,1241.119995,1247.069946,1247.069946,379696400.0
112453,N100,2021-05-28,1249.469971,1259.209961,1249.030029,1256.599976,1256.599976,160773400.0
112454,N100,2021-05-31,1256.079956,1258.880005,1248.140015,1248.930054,1248.930054,91173700.0
112455,N100,2021-06-01,1254.609985,1265.660034,1254.609985,1258.579956,1258.579956,155179900.0
112456,N100,2021-06-02,1258.489990,1263.709961,1258.239990,1263.619995,1263.619995,148465000.0

## loc

- Label-based selection

    The second paradigm for attribute selection is the one followed by the loc operator: label-based selection. In this paradigm, it's the data index value, not its position, which matters.

In [18]:
df.loc[:5, 'Date'] # retrieve first 6 rows, at 'Date' column

0    1965-12-31
1    1966-01-03
2    1966-01-04
3    1966-01-05
4    1966-01-06
5    1966-01-07
Name: Date, dtype: object

In [19]:
df.loc[-5:, ['Date', 'Open', 'Volume']] # this actually returns all rows because negative slicing is not supported in loc

              Date         Open       Volume
0       1965-12-31   528.690002          0.0
1       1966-01-03   527.210022          0.0
2       1966-01-04   527.840027          0.0
3       1966-01-05   531.119995          0.0
4       1966-01-06   532.070007          0.0
...            ...          ...          ...
112452  2021-05-27  1241.119995  379696400.0
112453  2021-05-28  1249.469971  160773400.0
112454  2021-05-31  1256.079956   91173700.0
112455  2021-06-01  1254.609985  155179900.0
112456  2021-06-02  1258.489990  148465000.0

[112457 rows x 3 columns]

## Choosing between loc and iloc

    When choosing or transitioning between loc and iloc, there is one "gotcha" worth keeping in mind, which is that the two methods use slightly different indexing schemes.

    iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So 0:10 will select entries 0,...,9. loc, meanwhile, indexes inclusively. So 0:10 will select entries 0,...,10.

    Why the change? Remember that loc can index any stdlib type: strings, for example. If we have a DataFrame with index values Apples, ..., Potatoes, ..., and we want to select "all the alphabetical fruit choices between Apples and Potatoes", then it's a lot more convenient to index df.loc['Apples':'Potatoes'] than it is to index something like df.loc['Apples', 'Potatoet'] (t coming after s in the alphabet).

    This is particularly confusing when the DataFrame index is a simple numerical list, e.g. 0,...,1000. In this case df.iloc[0:1000] will return 1000 entries, while df.loc[0:1000] return 1001 of them! To get 1000 elements using loc, you will need to go one lower and ask for df.loc[0:999].

    Otherwise, the semantics of using loc are the same as those for iloc.

In [17]:
sf = pd.DataFrame({'Stock':['Apple', 'Google', 'OpenAI', 'Celsius', 'TIKTAK', 'META', 'HNG', 'XKJ', 'Alani'], 'Price':[100, 320, 482, 883, 432, 399, 732, None, 883], 'Location':['USA', 'CAN', 'CHIL', 'UAE', 'KOR', 'SEB', 'CHI', 'JAP', 'PHI'], 'ETF':['Y', 'Y', 'N', 'N', 'Y', 'Y', 'Y', 'N', 'Y'], 'Valid': [None, None, None, None, None, None, None, None, None], 'Shares': [139, 421, 123, 93, 212, 194, 283, 333, 93]})

In [20]:
sf.set_index('Stock', inplace=True) # set index to 'Stock' column, modifying the original DataFrame index

In [21]:
sf.head() # Stock is the indexing column for the DataFrame

         Price Location ETF Valid  Shares
Stock
Apple    100.0      USA   Y  None     139
Google   320.0      CAN   Y  None     421
OpenAI   482.0     CHIL   N  None     123
Celsius  883.0      UAE   N  None      93
TIKTAK   432.0      KOR   Y  None     212

In [23]:
sf.loc['Google':'TIKTAK', ['Location', 'ETF', 'Shares']]  # retrieve rows from 'Google' to 'TIKTAK', at 'Location' and 'ETF' columns

        Location ETF  Shares
Stock
Google       CAN   Y     421
OpenAI      CHIL   N     123
Celsius      UAE   N      93
TIKTAK       KOR   Y     212

## Conditional Selection

In [24]:
sf.Price > 400  # boolean mask for rows where Price is greater than 400, return a series of True/False

Stock
Apple      False
Google     False
OpenAI      True
Celsius     True
TIKTAK      True
META       False
HNG         True
XKJ        False
Alani       True
Name: Price, dtype: bool

In [25]:
sf.loc[sf['Price'] > 400, :] 
# sf['Price'] > 400 is a series of True/False values indicating whether each row meets the condition, if true the row is included in the result
# in the series of true/false values, if True, the corresponding row is included in the output DataFrame

         Price Location ETF Valid  Shares
Stock
OpenAI   482.0     CHIL   N  None     123
Celsius  883.0      UAE   N  None      93
TIKTAK   432.0      KOR   Y  None     212
HNG      732.0      CHI   Y  None     283
Alani    883.0      PHI   Y  None      93

In [26]:
sf.loc[(sf['Price'] > 300) & (sf['ETF'] == 'Y'), ['Location', 'Price', 'ETF']]
# retrieve rows where Price is greater than 300 and ETF is 'Y', at 'Location', 'Price', and 'ETF' columns
# the result this conditonal filtering is from two series of True/False values combined with the & operator

       Location  Price ETF
Stock
Google      CAN  320.0   Y
TIKTAK      KOR  432.0   Y
META        SEB  399.0   Y
HNG         CHI  732.0   Y
Alani       PHI  883.0   Y

In [27]:
sf['Price'] > 399

Stock
Apple      False
Google     False
OpenAI      True
Celsius     True
TIKTAK      True
META       False
HNG         True
XKJ        False
Alani       True
Name: Price, dtype: bool

In [30]:
sf[sf['Price'] > 399] # return a dataframe with only rows where Price is greater than 399

         Price Location ETF Valid  Shares
Stock
OpenAI   482.0     CHIL   N  None     123
Celsius  883.0      UAE   N  None      93
TIKTAK   432.0      KOR   Y  None     212
HNG      732.0      CHI   Y  None     283
Alani    883.0      PHI   Y  None      93

In [31]:
sf.loc[sf['Location'].isin(['CHI', 'JAP', 'USA'])] 
# return a dataframe with rows where Location is either 'CHI', 'JAP', or 'USA'

       Price Location ETF Valid  Shares
Stock
Apple  100.0      USA   Y  None     139
HNG    732.0      CHI   Y  None     283
XKJ      NaN      JAP   N  None     333

In [32]:
sf.loc[sf.Price.notnull()]  # return a dataframe with rows where Price is not null

         Price Location ETF Valid  Shares
Stock
Apple    100.0      USA   Y  None     139
Google   320.0      CAN   Y  None     421
OpenAI   482.0     CHIL   N  None     123
Celsius  883.0      UAE   N  None      93
TIKTAK   432.0      KOR   Y  None     212
META     399.0      SEB   Y  None     194
HNG      732.0      CHI   Y  None     283
Alani    883.0      PHI   Y  None      93

## Markdown Notes:

    iloc vs loc

- iloc 'looking at the position at that index'
- loc 'looks up the index, look for a specific entry'

## Assign

In [33]:
sf['Valid'] = 67 # assign all rows in the series 'Valid' to 67

In [34]:
sf.loc[sf.index == 'Apple', 'Price'] = 1010 
# set the 'Price' for the row with index 'Apple' to 1010

In [35]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Apple    1010.0      USA   Y     67     139
Google    320.0      CAN   Y     67     421
OpenAI    482.0     CHIL   N     67     123
Celsius   883.0      UAE   N     67      93
TIKTAK    432.0      KOR   Y     67     212
META      399.0      SEB   Y     67     194
HNG       732.0      CHI   Y     67     283
XKJ         NaN      JAP   N     67     333
Alani     883.0      PHI   Y     67      93

In [36]:
sf.iloc[2:7, 0] # this is a series, return only price series

Stock
OpenAI     482.0
Celsius    883.0
TIKTAK     432.0
META       399.0
HNG        732.0
Name: Price, dtype: float64

In [37]:
sf.iloc[2:7, :1] # slices return a dataframe

         Price
Stock
OpenAI   482.0
Celsius  883.0
TIKTAK   432.0
META     399.0
HNG      732.0

In [38]:
sf.loc['OpenAI':'HNG', 'Valid'] = 9999 
# from 'OpenAI' to 'HNG' rows, assign the value 9999 to the 'Valid' column

In [39]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Apple    1010.0      USA   Y     67     139
Google    320.0      CAN   Y     67     421
OpenAI    482.0     CHIL   N   9999     123
Celsius   883.0      UAE   N   9999      93
TIKTAK    432.0      KOR   Y   9999     212
META      399.0      SEB   Y   9999     194
HNG       732.0      CHI   Y   9999     283
XKJ         NaN      JAP   N     67     333
Alani     883.0      PHI   Y     67      93

In [40]:
sf['Valid'] = range(len(sf), 0, -1) 
# len(sf) returns the number of rows in the DataFrame, so this assigns a descending range of values to the 'Valid' column

In [41]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Apple    1010.0      USA   Y      9     139
Google    320.0      CAN   Y      8     421
OpenAI    482.0     CHIL   N      7     123
Celsius   883.0      UAE   N      6      93
TIKTAK    432.0      KOR   Y      5     212
META      399.0      SEB   Y      4     194
HNG       732.0      CHI   Y      3     283
XKJ         NaN      JAP   N      2     333
Alani     883.0      PHI   Y      1      93

In [42]:
sf.sort_values(by='Price', inplace=True)

In [43]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      4     194
TIKTAK    432.0      KOR   Y      5     212
OpenAI    482.0     CHIL   N      7     123
HNG       732.0      CHI   Y      3     283
Celsius   883.0      UAE   N      6      93
Alani     883.0      PHI   Y      1      93
Apple    1010.0      USA   Y      9     139
XKJ         NaN      JAP   N      2     333

In [44]:
sf.sort_values(by='Valid').loc[:, ['Price', 'Valid']] 
# sort by 'Valid' column and return the 'Price' column

          Price  Valid
Stock
Alani     883.0      1
XKJ         NaN      2
HNG       732.0      3
META      399.0      4
TIKTAK    432.0      5
Celsius   883.0      6
OpenAI    482.0      7
Google    320.0      8
Apple    1010.0      9

In [45]:
print(sf)

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      4     194
TIKTAK    432.0      KOR   Y      5     212
OpenAI    482.0     CHIL   N      7     123
HNG       732.0      CHI   Y      3     283
Celsius   883.0      UAE   N      6      93
Alani     883.0      PHI   Y      1      93
Apple    1010.0      USA   Y      9     139
XKJ         NaN      JAP   N      2     333

In [46]:
max_price = sf['Price'] < 600
type = sf['ETF'].isin(['Y'])

sf.loc[max_price & type, :]

        Price Location ETF  Valid  Shares
Stock
Google  320.0      CAN   Y      8     421
META    399.0      SEB   Y      4     194
TIKTAK  432.0      KOR   Y      5     212

## Summary of Functions / Maps


        However, the data does not always come out of memory in the format we want it in right out of the bat. Sometimes we have to do some more work ourselves to reformat it for the task at hand. This tutorial will cover different operations we can apply to our data to get the input "just right".

In [47]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      4     194
TIKTAK    432.0      KOR   Y      5     212
OpenAI    482.0     CHIL   N      7     123
HNG       732.0      CHI   Y      3     283
Celsius   883.0      UAE   N      6      93
Alani     883.0      PHI   Y      1      93
Apple    1010.0      USA   Y      9     139
XKJ         NaN      JAP   N      2     333

In [48]:
sf.describe() # returns a dataframe with statistical summary of all numeric columns

             Price     Valid      Shares
count     8.000000  9.000000    9.000000
mean    642.625000  5.000000  210.111111
std     265.145748  2.738613  114.688104
min     320.000000  1.000000   93.000000
25%     423.750000  3.000000  123.000000
50%     607.000000  5.000000  194.000000
75%     883.000000  7.000000  283.000000
max    1010.000000  9.000000  421.000000

In [49]:
sf.Price.describe() # returns a series with statistical summary of the 'Price' column

count       8.000000
mean      642.625000
std       265.145748
min       320.000000
25%       423.750000
50%       607.000000
75%       883.000000
max      1010.000000
Name: Price, dtype: float64

In [50]:
sf.Price.mean() # returns the mean of the 'Price' column

np.float64(642.625)

In [51]:
sf.Location.unique() # returns an array of unique values in the 'array' column

array(['CAN', 'SEB', 'KOR', 'CHIL', 'CHI', 'UAE', 'PHI', 'USA', 'JAP'],
      dtype=object)

In [52]:
sf.ETF.value_counts() # returns a series with counts of unique values in the 'ETF' column

ETF
Y    6
N    3
Name: count, dtype: int64

# **Pandas Testing**

In [53]:
sf.count() # count non-null entries for each column

Price       8
Location    9
ETF         9
Valid       9
Shares      9
dtype: int64

In [ ]:
price_mean = sf.Price.mean() # returns the mean of the 'Price' column

print('Price Mean:', price_mean)

sf.Price.map(lambda x: x - price_mean) 
# return a series of the form (current index value - mean) for each index in the 'Price' column

Price Mean: 642.625

Stock
Google    -322.625
META      -243.625
TIKTAK    -210.625
OpenAI    -160.625
HNG         89.375
Celsius    240.375
Alani      240.375
Apple      367.375
XKJ            NaN
Name: Price, dtype: float64

In [ ]:
import random

def randrow(row):
    row.Valid = random.randint(0, 10)
    return row

sf.apply(randrow, axis=1) # this does not modify the original DataFrame

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      0     421
META      399.0      SEB   Y      0     194
TIKTAK    432.0      KOR   Y      9     212
OpenAI    482.0     CHIL   N     10     123
HNG       732.0      CHI   Y      1     283
Celsius   883.0      UAE   N      7      93
Alani     883.0      PHI   Y      9      93
Apple    1010.0      USA   Y      3     139
XKJ         NaN      JAP   N      9     333

In [67]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      4     194
TIKTAK    432.0      KOR   Y      5     212
OpenAI    482.0     CHIL   N      7     123
HNG       732.0      CHI   Y      3     283
Celsius   883.0      UAE   N      6      93
Alani     883.0      PHI   Y      1      93
Apple    1010.0      USA   Y      9     139
XKJ         NaN      JAP   N      2     333

In [ ]:
sf.sum(axis=0, numeric_only=True) # sum of all numeric columns, axis=0 means summing down the rows for each column

Price     5141.0
Valid       45.0
Shares    1891.0
dtype: float64

In [75]:
sf.sum(axis=1, numeric_only=True) # sum of all numeric columns, axis=1 means summing across the columns for each row

Stock
Google      749.0
META        597.0
TIKTAK      649.0
OpenAI      612.0
HNG        1018.0
Celsius     982.0
Alani       977.0
Apple      1158.0
XKJ         335.0
dtype: float64

In [76]:
randrow(sf) # this modifies the original DataFrame 
# called with the whole DataFrame (row is the DataFrame)
# mutates sf in-place because you passed the DataFrame

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      8     194
TIKTAK    432.0      KOR   Y      8     212
OpenAI    482.0     CHIL   N      8     123
HNG       732.0      CHI   Y      8     283
Celsius   883.0      UAE   N      8      93
Alani     883.0      PHI   Y      8      93
Apple    1010.0      USA   Y      8     139
XKJ         NaN      JAP   N      8     333

In [77]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      8     421
META      399.0      SEB   Y      8     194
TIKTAK    432.0      KOR   Y      8     212
OpenAI    482.0     CHIL   N      8     123
HNG       732.0      CHI   Y      8     283
Celsius   883.0      UAE   N      8      93
Alani     883.0      PHI   Y      8      93
Apple    1010.0      USA   Y      8     139
XKJ         NaN      JAP   N      8     333

In [78]:
sf.Valid = range(len(sf), 0, -1) # revert values back

In [79]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      9     421
META      399.0      SEB   Y      8     194
TIKTAK    432.0      KOR   Y      7     212
OpenAI    482.0     CHIL   N      6     123
HNG       732.0      CHI   Y      5     283
Celsius   883.0      UAE   N      4      93
Alani     883.0      PHI   Y      3      93
Apple    1010.0      USA   Y      2     139
XKJ         NaN      JAP   N      1     333

In [80]:
sf.Price - price_mean # built in mapping operation

Stock
Google    -322.625
META      -243.625
TIKTAK    -210.625
OpenAI    -160.625
HNG         89.375
Celsius    240.375
Alani      240.375
Apple      367.375
XKJ            NaN
Name: Price, dtype: float64

In [81]:
sf.Location + " - " + sf.ETF # concatenate strings from 'Location' and 'ETF' columns with " - " in between

Stock
Google      CAN - Y
META        SEB - Y
TIKTAK      KOR - Y
OpenAI     CHIL - N
HNG         CHI - Y
Celsius     UAE - N
Alani       PHI - Y
Apple       USA - Y
XKJ         JAP - N
dtype: object

In [82]:
print(sf.Price.median())

607.0

### Find Best Price to Share Ratio

In [83]:
price_to_share_ratio = sf.Price/sf.Shares # price to share ratio for each stock
print(price_to_share_ratio)

Stock
Google     0.760095
META       2.056701
TIKTAK     2.037736
OpenAI     3.918699
HNG        2.586572
Celsius    9.494624
Alani      9.494624
Apple      7.266187
XKJ             NaN
dtype: float64

In [ ]:
highest_stock1 = sf.apply(lambda x: x.Price/x.Shares, axis=1).sort_values(ascending=False).index[0] 
# returns the index of the stock with the highest price to share ratio
print(highest_stock1)

Alani

In [85]:
highest_stock2 = price_to_share_ratio.idxmax() # returns the index of the maximum value in the series
print(highest_stock2)

Celsius

In [86]:
print(sf.to_string())

          Price Location ETF  Valid  Shares
Stock
Google    320.0      CAN   Y      9     421
META      399.0      SEB   Y      8     194
TIKTAK    432.0      KOR   Y      7     212
OpenAI    482.0     CHIL   N      6     123
HNG       732.0      CHI   Y      5     283
Celsius   883.0      UAE   N      4      93
Alani     883.0      PHI   Y      3      93
Apple    1010.0      USA   Y      2     139
XKJ         NaN      JAP   N      1     333

In [87]:
sf.reset_index(inplace=True) # set index back to default integer index
print(sf)

     Stock   Price Location ETF  Valid  Shares
0   Google   320.0      CAN   Y      9     421
1     META   399.0      SEB   Y      8     194
2   TIKTAK   432.0      KOR   Y      7     212
3   OpenAI   482.0     CHIL   N      6     123
4      HNG   732.0      CHI   Y      5     283
5  Celsius   883.0      UAE   N      4      93
6    Alani   883.0      PHI   Y      3      93
7    Apple  1010.0      USA   Y      2     139
8      XKJ     NaN      JAP   N      1     333

In [88]:
max_ratio = sf.dropna(subset=['Price', 'Shares']).loc[:, ['Price', 'Shares']].apply(lambda x: x.Price/x.Shares, axis=1).max()
mask = (sf.Price/sf.Shares) == max_ratio
sf.loc[mask,:]
# retrieve the row(s) with the highest price to share ratio
# 1. sf.Price/sf.Shares computes the price to share ratio for each stock, resulting in a series
# 2. sf.dropna(subset=['Price', 'Shares']) removes rows with null values in 'Price' or 'Shares' columns to avoid errors during division
# 3. .loc[:, ['Price', 'Shares']] selects only the 'Price' and 'Shares' columns
# 4. .apply(lambda x: x.Price/x.Shares, axis=1).max() computes the price to share ratio for each row and returns the maximum value
### Find Best Price to Share Ratio

     Stock  Price Location ETF  Valid  Shares
5  Celsius  883.0      UAE   N      4      93
6    Alani  883.0      PHI   Y      3      93

### Pandas Testing on Wine Reviews Dataset

In [89]:
import string
reviews = pd.read_csv('wine_dataset/winemag-data-130k-v2.csv', index_col=0)

In [90]:
reviews.head()

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,Italy,"Aromas include tropical fruit, broom, brimston...",VulkÃ Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin Oâ€™Keefe,@kerinokeefe,Nicosia 2013 VulkÃ Bianco (Etna),White Blend,Nicosia
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian
4,US,"Much like the regular bottling from 2012, this...",Vintner's Reserve Wild Child Block,87,65.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Sweet Cheeks 2012 Vintner's Reserve Wild Child...,Pinot Noir,Sweet Cheeks

#### Extract Counts of 'tropical'/'fruity' in Description Column

In [146]:
freq = {'tropical':0, 'fruity':0}
desc = [word.strip(string.punctuation).lower() for word in reviews.description[0].split()]
print(desc)
print(desc.count('tropical'))

['aromas', 'include', 'tropical', 'fruit', 'broom', 'brimstone', 'and', 'dried', 'herb', 'the', 'palate', "isn't", 'overly', 'expressive', 'offering', 'unripened', 'apple', 'citrus', 'and', 'dried', 'sage', 'alongside', 'brisk', 'acidity']
1

In [ ]:
for word in desc:  
   if word in freq:
      freq[word] += 1

print(freq)

{'tropical': 1, 'fruity': 0}

In [148]:
tf = pd.DataFrame(data=freq, index=[0])

In [149]:
print(tf)

   tropical  fruity
0         1       0

In [199]:
reviews.description.head()

0    Aromas include tropical fruit, broom, brimston...
1    This is ripe and fruity, a wine that is smooth...
2    Tart and snappy, the flavors of lime flesh and...
3    Pineapple rind, lemon pith and orange blossom ...
4    Much like the regular bottling from 2012, this...
Name: description, dtype: object

In [253]:
def frequency(desc):
    filter_desc = [word.strip(string.punctuation).lower() for word in desc.description.split()]
    tropical_count = filter_desc.count('tropical')
    fruit_count = filter_desc.count('fruity')
    return tropical_count, fruit_count

x = reviews.apply(frequency, axis=1)
print(x)

0         (1, 0)
1         (0, 1)
2         (0, 0)
3         (0, 0)
4         (0, 0)
           ...
129966    (0, 0)
129967    (0, 0)
129968    (0, 1)
129969    (0, 0)
129970    (0, 0)
Length: 129971, dtype: object

In [257]:
y = x.map(lambda x: x[0]).sum(axis=0)

print(y)

3638

In [258]:
z = x.map(lambda x: x[1]).sum(axis=0)

print(z)

9466

In [256]:
pd.DataFrame([y, z])

      0
0  3638
1  9466

In [268]:
tropical_count = reviews.description.map(lambda x: 'tropical' in x).sum() 
# count of reviews containing the word 'tropical', if true, counts as 1
fruity_count = reviews.description.map(lambda x: 'fruity' in x).sum()
# count of reviews containing the word 'fruity', if true, counts as 1

descriptor_count = pd.Series([tropical_count, fruity_count], index=['tropical', 'fruity'])
#return a series with index as the descriptor names and values as their respective counts

print(descriptor_count)

tropical    3607
fruity      9090
dtype: int64

### Star rating based on points and country

In [ ]:
def wrapper(row):
    if ((row.points >= 95) & (row.country != 'Canada')) or (row.country == 'Canada'):
        return 3
    elif (row.points >= 85) & (row.country != 'Canada'):
        return 2
    else:
        return 1

star_ratings = reviews.apply(wrapper, axis=1)

print(star_ratings.value_counts())

2    114877
1     12421
3      2673
Name: count, dtype: int64